tutorial/compressionTest/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Dm              Dm [0 2 -1 0 0 0 0] 2e-9;
Sc              Sc [0 0 0 0 0 0 0] 0.7;
//--------------------properties for the compression term
betaComp	betaComp [1 -3 0 0 0 0 0] 2.46;		//-dummy value
lambdaComp	lambdaComp [1 -1 -2 0 0 0 0] 0.842;	//-dummy value
alphaComp	alphaComp [0 0 0 0 0 0 0] 1e-3; 
gComp		gComp [0 1 -2 0 0 0 0] 9.81;
dummyComp	dummyComp [0 0 -0 0 0 0 0] 1;
			
phases (sludge water);

sludge
{
    transportModel  BinghamPlastic;

    "(plastic|BinghamPlastic)Coeffs"
    {
        coeff       0.00023143;
        exponent    179.26;

        BinghamCoeff    0.0005966;
        BinghamExponent 1050.8;
        BinghamOffset   0;

        muMax       10;
    }

    rho         1996;
}

water
{
    transportModel  Newtonian;

    nu              1.7871e-06;
    rho             996;
}

relativeVelocityModel simple;

"(simple|general)Coeffs"
{
    V0              (0 -0.002198 0);
    a               285.84;
    a1              0.1;
    residualAlpha   0;
}


// ************************************************************************* //
